[
  {
    "id": 1,
    "name": "Mercury",
    "introduction": "The smallest planet in our solar system and nearest to the Sun, Mercury is only slightly larger than Earth's Moon.",
    "description": "From the surface of Mercury, the Sun would appear more than three times as large as it does when viewed from Earth, and the sunlight would be as much as seven times brighter. Despite its proximity to the Sun, Mercury is not the hottest planet in our solar system – that title belongs to nearby Venus, thanks to its dense atmosphere. \n Mercury formed about 4.5 billion years ago when gravity pulled swirling gas and dust together to form this small planet nearest the Sun. Like its fellow terrestrial planets, Mercury has a central core, a rocky mantle and a solid crust. \n Mercury formed about 4.5 billion years ago when gravity pulled swirling gas and dust together to form this small planet nearest the Sun. Like its fellow terrestrial planets, Mercury has a central core, a rocky mantle and a solid crust. \n Temperatures on the surface of Mercury are extreme, both hot and cold. During the day, temperatures on Mercury's surface can reach 800 degrees Fahrenheit (430 degrees Celsius). Because the planet has no atmosphere to retain that heat, nighttime temperatures on the surface can drop to minus 290 degrees Fahrenheit (minus 180 degrees Celsius). \n Mercury may have water ice at its north and south poles inside deep craters, but only in regions of permanent shadow. There it could be cold enough to preserve water ice despite the high temperatures on sunlit parts of the planet.",
    "density": 5.43,
    "tilt": 2,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/769_PIA16820.jpg",
    "rotationperiod": 1408,
    "period": 0.24,
    "radius": 2439,
    "moons": 0,
    "au": 0.3871,
    "eccentricity": 0.206,
    "velocity": 47.89,
    "mass": 0.06,
    "inclination": 7,
    "type": "Terrestrial",
    "ordinal": 1
  },
  {
    "id": 2,
    "name": "Venus",
    "introduction": "The second planet from the Sun and our closest planetary neighbor.",
    "description": "Similar in structure and size to Earth, Venus spins slowly in the opposite direction from most planets. Its thick atmosphere traps heat in a runaway greenhouse effect, making it the hottest planet in our solar system with surface temperatures hot enough to melt lead. Glimpses below the clouds reveal volcanoes and deformed mountains. \n Venus is named for the ancient Roman goddess of love and beauty, who was known as Aphrodite to the Ancient Greeks. \n When the solar system settled into its current layout about 4.5 billion years ago, Venus formed when gravity pulled swirling gas and dust together to form the second planet from the Sun. Like its fellow terrestrial planets, Venus has a central core, a rocky mantle and a solid crust. \n From space, Venus is bright white because it is covered with clouds that reflect and scatter sunlight. At the surface, the rocks are different shades of grey, like rocks on Earth, but the thick atmosphere filters the sunlight so that everything would look orange if you were standing on Venus. \n Venus has mountains, valleys, and tens of thousands of volcanoes. The highest mountain on Venus, Maxwell Montes, is 20,000 feet high (8.8 kilometers), similar to the highest mountain on Earth, Mount Everest. The landscape is dusty, and surface temperatures reach a scalding 880 degrees Fahrenheit (471 degrees Celsius). \n ",
    "density": 5.25,
    "tilt": 177.3,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/688_Venus.jpg",
    "rotationperiod": 5832,
    "period": 0.62,
    "radius": 6052,
    "moons": 0,
    "au": 0.7233,
    "eccentricity": 0.007,
    "velocity": 35.04,
    "mass": 0.82,
    "inclination": 3.4,
    "type": "Terrestrial",
    "ordinal": 2
  },
  {
    "id": 3,
    "name": "Earth",
    "introduction": "Our home planet is the third planet from the Sun, and the only place we know of so far that’s inhabited by living things.",
    "description": "While Earth is only the fifth largest planet in the solar system, it is the only world in our solar system with liquid water on the surface. Just slightly larger than nearby Venus, Earth is the biggest of the four planets closest to the Sun, all of which are made of rock and metal. \n The name Earth is at least 1,000 years old. All of the planets, except for Earth, were named after Greek and Roman gods and goddesses. However, the name Earth is a Germanic word, which simply means “the ground.” \n When the solar system settled into its current layout about 4.5 billion years ago, Earth formed when gravity pulled swirling gas and dust in to become the third planet from the Sun. Like its fellow terrestrial planets, Earth has a central core, a rocky mantle and a solid crust. \n Like Mars and Venus, Earth has volcanoes, mountains and valleys. Earth's lithosphere, which includes the crust (both continental and oceanic) and the upper mantle, is divided into huge plates that are constantly moving. For example, the North American plate moves west over the Pacific Ocean basin, roughly at a rate equal to the growth of our fingernails. Earthquakes result when plates grind past one another, ride up over one another, collide to make mountains, or split and separate. \n Earth's global ocean, which covers nearly 70 percent of the planet's surface, has an average depth of about 2.5 miles (4 kilometers) and contains 97 percent of Earth's water. Almost all of Earth's volcanoes are hidden under these oceans. Hawaii's Mauna Kea volcano is taller from base to summit than Mount Everest, but most of it is underwater. Earth's longest mountain range is also underwater, at the bottom of the Arctic and Atlantic oceans. It is four times longer than the Andes, Rockies and Himalayas combined.",
    "density": 5.52,
    "tilt": 23.45,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/786_1-bluemarble_west.jpg",
    "rotationperiod": 23.93,
    "period": 1,
    "radius": 6378,
    "moons": 1,
    "au": 1,
    "eccentricity": 0.017,
    "velocity": 29.79,
    "mass": 1,
    "inclination": 0,
    "type": "Terrestrial",
    "ordinal": 3
  },
  {
    "id": 4,
    "name": "Mars",
    "introduction": "The fourth planet from the Sun, Mars is a dusty, cold, desert world with a very thin atmosphere.",
    "description": "This dynamic planet has seasons, polar ice caps and weather and canyons and extinct volcanoes, evidence of an even more active past. \n Mars is one of the most explored bodies in our solar system, and it's the only planet where we've sent rovers to roam the alien landscape. NASA currently has three spacecraft in orbit, one rover and one lander on the surface and another rover under construction here on Earth. India and ESA also have spacecraft in orbit above Mars. \n These robotic explorers have found lots of evidence that Mars was much wetter and warmer, with a thicker atmosphere, billions of years ago. \n No planet beyond Earth has been studied as intensely as Mars. Recorded observations of Mars date as far back as the era of ancient Egypt over 4,000 years ago, when they charted the planet's movements in the sky. Today, a science fleet of robotic spacecraft study Mars from all angles. \n When the solar system settled into its current layout about 4.5 billion years ago, Mars formed when gravity pulled swirling gas and dust in to become the fourth planet from the Sun. Mars is about half the size of Earth, and like its fellow terrestrial planets, it has a central core, a rocky mantle and a solid crust. \n The Red Planet is actually many colors. At the surface we see colors such as brown, gold and tan. The reason Mars looks reddish is due to oxidization—or rusting—of iron in the rocks, regolith (Martian “soil”), and dust of Mars. This dust gets kicked up into the atmosphere and from a distance makes the planet appear mostly red. \n Interestingly, while Mars is about half the diameter of Earth, its surface has nearly the same area as Earth’s dry land. Its volcanoes, impact craters, crustal movement, and atmospheric conditions such as dust storms have altered the landscape of Mars over many years, creating some of the solar system's most interesting topographical features. \n A large canyon system called Valles Marineris is long enough to stretch from California to New York—more than 3,000 miles (4,800 kilometers). This Martian canyon is 200 miles (320 kilometers) at its widest and 4.3 miles (7 kilometers) at its deepest. That's about 10 times the size of Earth's Grand Canyon.",
    "density": 3.95,
    "tilt": 25.19,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/683_6453_mars-globe-valles-marineris-enhanced-full2.jpg",
    "rotationperiod": 24.62,
    "period": 1.88,
    "radius": 3397,
    "moons": 2,
    "au": 1.524,
    "eccentricity": 0.093,
    "velocity": 24.14,
    "mass": 0.11,
    "inclination": 1.85,
    "type": "Terrestrial",
    "ordinal": 4
  },
  {
    "id": 5,
    "name": "Jupiter",
    "introduction": "The fifth planet from our Sun and is, by far, the largest planet in the solar system – more than twice as massive as all the other planets combined.",
    "description": "Jupiter's stripes and swirls are actually cold, windy clouds of ammonia and water, floating in an atmosphere of hydrogen and helium. Jupiter’s iconic Great Red Spot is a giant storm bigger than Earth that has raged for hundreds of years. \n Jupiter is surrounded by dozens of moons. Jupiter also has several rings, but unlike the famous rings of Saturn, Jupiter’s rings are very faint and made of dust, not ice. \n Nine spacecraft have studied Jupiter up close. NASA's Juno spacecraft is currently studying the gas giant planet from orbit. The spacecraft, which arrived at Jupiter in July 2016, is the first to study the planet's mysterious, cloud-shrouded interior. Scientists also use the Earth-orbiting Hubble Space Telescope and ground-based telescopes to regularly check in on Jupiter. \n Jupiter took shape when the rest of the solar system formed about 4.5 billion years ago, when gravity pulled swirling gas and dust in to become this gas giant. Jupiter took most of the mass left over after the formation of the Sun, ending up with more than twice the combined material of the other bodies in the solar system. In fact, Jupiter has the same ingredients as a star, but it did not grow massive enough to ignite. \n About 4 billion years ago, Jupiter settled into its current position in the outer solar system, where it is the fifth planet from the Sun. \n As a gas giant, Jupiter doesn’t have a true surface. The planet is mostly swirling gases and liquids. While a spacecraft would have nowhere to land on Jupiter, it wouldn’t be able to fly through unscathed either. The extreme pressures and temperatures deep inside the planet crush, melt and vaporize spacecraft trying to fly into the planet.",
    "density": 1.33,
    "tilt": 3.12,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/2486_stsci-h-p1936a_1800.jpg",
    "rotationperiod": 9.92,
    "period": 11.86,
    "radius": 71490,
    "moons": 28,
    "au": 5.203,
    "eccentricity": 0.048,
    "velocity": 13.06,
    "mass": 317.89,
    "inclination": 1.3,
    "type": "Gas giant",
    "ordinal": 5
  },
  {
    "id": 6,
    "name": "Saturn",
    "introduction": "The sixth planet from the Sun and the second largest planet in our solar system.",
    "description": "Adorned with thousands of beautiful ringlets, Saturn is unique among the planets. It is not the only planet to have rings—made of chunks of ice and rock—but none are as spectacular or as complicated as Saturn's. \n Like fellow gas giant Jupiter, Saturn is a massive ball made mostly of hydrogen and helium. \n Surrounded by more than 60 known moons, Saturn is home to some of the most fascinating landscapes in our solar system. From the jets of water that spray from Enceladus to the methane lakes on smoggy Titan, the Saturn system is a rich source of scientific discovery and still holds many mysteries. \n The farthest planet from Earth discovered by the unaided human eye, Saturn has been known since ancient times. The planet is named for the Roman god of agriculture and wealth, who was also the father of Jupiter. \n Saturn took shape when the rest of the solar system formed about 4.5 billion years ago, when gravity pulled swirling gas and dust in to become this gas giant. About 4 billion years ago, Saturn settled into its current position in the outer solar system, where it is the sixth planet from the Sun. Like Jupiter, Saturn is mostly made of hydrogen and helium, the same two main components that make up the Sun. \n As a gas giant, Saturn doesn’t have a true surface. The planet is mostly swirling gases and liquids deeper down. While a spacecraft would have nowhere to land on Saturn, it wouldn’t be able to fly through unscathed either. The extreme pressures and temperatures deep inside the planet crush, melt and vaporize spacecraft trying to fly into the planet.",
    "density": 0.69,
    "tilt": 26.73,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/16020_6020_IMG005020_ai_wm_display.jpg",
    "rotationperiod": 10.66,
    "period": 29.46,
    "radius": 60268,
    "moons": 30,
    "au": 9.539,
    "eccentricity": 0.056,
    "velocity": 9.64,
    "mass": 95.18,
    "inclination": 2.49,
    "type": "Gas giant",
    "ordinal": 6
  },
  {
    "id": 7,
    "name": "Uranus",
    "introduction": "The seventh planet from the Sun with the third largest diameter in our solar system, Uranus is very cold and windy.",
    "description": "The ice giant is surrounded by 13 faint rings and 27 small moons as it rotates at a nearly 90-degree angle from the plane of its orbit. This unique tilt makes Uranus appear to spin on its side, orbiting the Sun like a rolling ball. \n The first planet found with the aid of a telescope, Uranus was discovered in 1781 by astronomer William Herschel, although he originally thought it was either a comet or a star. It was two years later that the object was universally accepted as a new planet, in part because of observations by astronomer Johann Elert Bode. \n William Herschel tried unsuccessfully to name his discovery Georgium Sidus after King George III. Instead the planet was named for Uranus, the Greek god of the sky, as suggested by Johann Bode. \n Uranus is the only planet whose equator is nearly at a right angle to its orbit, with a tilt of 97.77 degrees—possibly the result of a collision with an Earth-sized object long ago. This unique tilt causes the most extreme seasons in the solar system. For nearly a quarter of each Uranian year, the Sun shines directly over each pole, plunging the other half of the planet into a 21-year-long, dark winter. \n Uranus is also one of just two planets that rotate in the opposite direction than most of the planets (Venus is the other one), from east to west. \n Uranus took shape when the rest of the solar system formed about 4.5 billion years ago, when gravity pulled swirling gas and dust in to become this ice giant. Like its neighbor Neptune, Uranus likely formed closer to the Sun and moved to the outer solar system about 4 billion years ago, where it is the seventh planet from the Sun. \n As an ice giant, Uranus doesn’t have a true surface. The planet is mostly swirling fluids. While a spacecraft would have nowhere to land on Uranus, it wouldn’t be able to fly through its atmosphere unscathed either. The extreme pressures and temperatures would destroy a metal spacecraft.",
    "density": 1.29,
    "tilt": 97.86,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/599_PIA18182.jpg",
    "rotationperiod": 17.24,
    "period": 84.01,
    "radius": 25559,
    "moons": 24,
    "au": 19.19,
    "eccentricity": 0.046,
    "velocity": 6.81,
    "mass": 14.53,
    "inclination": 0.77,
    "type": "Ice giant",
    "ordinal": 7
  },
  {
    "id": 8,
    "name": "Neptune",
    "introduction": "Dark, cold and whipped by supersonic winds, ice giant Neptune is the eighth and most distant planet in our solar system.",
    "description": "More than 30 times as far from the Sun as Earth, Neptune is the only planet in our solar system not visible to the naked eye. In 2011 Neptune completed its first 165-year orbit since its discovery in 1846. \n Neptune is so far from the Sun that high noon on the big blue planet would seem like dim twilight to us. The warm light we see here on our home planet is roughly 900 times as bright as sunlight on Neptune. \n The ice giant Neptune was the first planet located through mathematical calculations. Using predictions made by Urbain Le Verrier, Johann Galle discovered the planet in 1846. The planet is named after the Roman god of the sea, as suggested by Le Verrier. \n Sometimes Neptune is even farther from the Sun than dwarf planet Pluto. Pluto's highly eccentric, oval-shaped orbit brings it inside Neptune's orbit for a 20-year period every 248 Earth years. This switch, in which Pluto is closer to the Sun than Neptune, happened most recently from 1979 to 1999. Pluto can never crash into Neptune, though, because for every three laps Neptune takes around the Sun, Pluto makes two. This repeating pattern prevents close approaches of the two bodies. \n Neptune’s axis of rotation is tilted 28 degrees with respect to the plane of its orbit around the Sun, which is similar to the axial tilts of Mars and Earth. This means that Neptune experiences seasons just like we do on Earth; however, since its year is so long, each of the four seasons lasts for over 40 years. \n Neptune took shape when the rest of the solar system formed about 4.5 billion years ago, when gravity pulled swirling gas and dust in to become this ice giant. Like its neighbor Uranus, Neptune likely formed closer to the Sun and moved to the outer solar system about 4 billion years ago. \n Neptune does not have a solid surface. Its atmosphere (made up mostly of hydrogen, helium and methane) extends to great depths, gradually merging into water and other melted ices over a heavier, solid core with about the same mass as Earth.",
    "density": 1.64,
    "tilt": 29.6,
    "imageUrl": "https://solarsystem.nasa.gov/system/resources/detail_files/611_PIA01492.jpg",
    "rotationperiod": 16.11,
    "period": 164.79,
    "radius": 25269,
    "moons": 8,
    "au": 30.06,
    "eccentricity": 0.01,
    "velocity": 6.81,
    "mass": 17.14,
    "inclination": 1.77,
    "type": "Ice giant",
    "ordinal": 8
  }
]
